## Select data from a table using "select" on SQL

In [1]:
% load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%%sql 
create table TEST (
    ID integer,
    NAME varchar(30)
    );

 * sqlite://
Done.

[]

In [4]:
%%sql
drop table TEST

 * sqlite://
Done.

[]

In [5]:
%%sql
create table COUNTRY (
    ID int,
    CCODE char(2),
    NAME varchar(60)
    );

 * sqlite://
Done.

[]

In [6]:
%%sql
select ID,NAME from COUNTRY;

 * sqlite://
Done.

[]

In [7]:
%%sql 
select * from COUNTRY;

 * sqlite://
Done.

[]

In [8]:
%%sql
select * from COUNTRY where  ID < 5;

 * sqlite://
Done.

[]

In [9]:
%%sql
select * from COUNTRY where CCODE = 'CA';

 * sqlite://
Done.

[]

Number of rows in a table:

In [10]:
%%sql
select COUNT(*) from COUNTRY

 * sqlite://
Done.

[(0,)]

Rows in the COUNTRY table where Country is CANADA

In [11]:
%%sql
select COUNT(COUNTRY) from COUNTRY
   where COUNTRY = 'CANADA'

 * sqlite://
(sqlite3.OperationalError) no such column: COUNTRY [SQL: "select COUNT(COUNTRY) from COUNTRY\n   where COUNTRY = 'CANADA'"] (Background on this error at: http://sqlalche.me/e/e3q8)

Retrieve unique values in a column

In [12]:
%%sql
select DISTINCT ID from COUNTRY

 * sqlite://
Done.

[]

Consider the table MEDALS (example)

In [13]:
%%sql
create table MEDALS (
    YEAR int,
    CCODE char(2),
    NAME varchar(60)
    );

 * sqlite://
Done.

[]

Retrieve 5 rows in the MEDALS table for a particular year

In [14]:
%%sql

select * from MEDALS
  where YEAR = 2018 LIMIT 5

 * sqlite://
Done.

[]

## Let's see another table

In [15]:
%%sql

create table INSTRUCTOR (
    ins_id int NOT NULL,
    lastname VARCHAR(20) NOT NULL,
    firstname VARCHAR(20)NOT NULL,
    city VARCHAR(20),
    country CHAR(2),    

    PRIMARY KEY(ins_id)
);

 * sqlite://
Done.

[]

In [16]:
%%sql

INSERT INTO INSTRUCTOR
   (ins_id, lastname, firstname, city, country)

   VALUES
   (1, 'Ahuja', 'Rav', 'Toronto', 'CA')
  ;

 * sqlite://
1 rows affected.

[]

In [17]:
%%sql

INSERT INTO INSTRUCTOR
  VALUES
  (2, 'Chong', 'Raul', 'Toronto', 'CA'),
  (3, 'Vasudevan', 'Hima', 'Chicago', 'US')
;

 * sqlite://
2 rows affected.

[]

In [18]:
%%sql

select * from INSTRUCTOR

 * sqlite://
Done.

[(1, 'Ahuja', 'Rav', 'Toronto', 'CA'),
 (2, 'Chong', 'Raul', 'Toronto', 'CA'),
 (3, 'Vasudevan', 'Hima', 'Chicago', 'US')]

Retrieving names starting with 'R' in the first name column

In [19]:
%%sql

select firstname from INSTRUCTOR
where firstname like "R%"

 * sqlite://
Done.

[('Rav',), ('Raul',)]

Retrieving id's greater or equal to 1 and less or equal to 2

In [20]:
%%sql

select ins_id, firstname, lastname from INSTRUCTOR
where  ins_id >= 1 AND ins_id <=2

 * sqlite://
Done.

[(1, 'Rav', 'Ahuja'), (2, 'Raul', 'Chong')]

In [21]:
%%sql

select ins_id, firstname, lastname from INSTRUCTOR
where ins_id between 1 and 2

 * sqlite://
Done.

[(1, 'Rav', 'Ahuja'), (2, 'Raul', 'Chong')]

By country

In [22]:
%%sql

select firstname, lastname, country from INSTRUCTOR
where country ='CA' or country ='US'

 * sqlite://
Done.

[('Rav', 'Ahuja', 'CA'), ('Raul', 'Chong', 'CA'), ('Hima', 'Vasudevan', 'US')]

In [23]:
%%sql

select firstname, lastname, country from INSTRUCTOR 
where country = 'CA'

 * sqlite://
Done.

[('Rav', 'Ahuja', 'CA'), ('Raul', 'Chong', 'CA')]

In [24]:
%%sql

Select firstname, lastname, country from INSTRUCTOR
where country IN ('CA', 'US')

 * sqlite://
Done.

[('Rav', 'Ahuja', 'CA'), ('Raul', 'Chong', 'CA'), ('Hima', 'Vasudevan', 'US')]

## Sorting Result Sets
_the codes doesn't run with the #_

In [31]:
%%sql

select lastname from INSTRUCTOR
order by lastname # Alphabetical order

 * sqlite://
Done.

[('Ahuja',), ('Chong',), ('Vasudevan',)]

In [32]:
%%sql

select lastname from INSTRUCTOR
order by lastname desc # Alphabetical order descending

 * sqlite://
Done.

[('Vasudevan',), ('Chong',), ('Ahuja',)]

In [33]:
%%sql

select lastname, ins_id from INSTRUCTOR
order by 2  # order by the second specified, in that case, "ins_id"

 * sqlite://
Done.

[('Ahuja', 1), ('Chong', 2), ('Vasudevan', 3)]

In [34]:
%%sql

select lastname, ins_id, firstname from INSTRUCTOR
order by 3 # order by the third specified, in that case, "firstname"

 * sqlite://
Done.

[('Vasudevan', 3, 'Hima'), ('Chong', 2, 'Raul'), ('Ahuja', 1, 'Rav')]

## Grouping Result Sets

In [30]:
%%sql

select country from INSTRUCTOR 
order by 1

 * sqlite://
Done.

[('CA',), ('CA',), ('US',)]

In [36]:
%%sql

select distinct(country)
from INSTRUCTOR # remove the duplicates

 * sqlite://
Done.

[('CA',), ('US',)]

In [37]:
%%sql

select country, count(country)
as count from INSTRUCTOR group by country

 * sqlite://
Done.

[('CA', 2), ('US', 1)]

In [38]:
%%sql

select country, count(country)
as count from INSTRUCTOR group by country having count(country) > 1

 * sqlite://
Done.

[('CA', 2)]

### Obs: the 'where' clause is used to restrict the entire result set, whereas the 'having' clause is used only with the "GROUP BY" clause